perf/load_testing/dictionary.yaml
config:
    environments:
        app:
            target: "http://localhost:5555"
            plugins:
                statsd:
                    host: localhost
                    port: 8125
                    prefix: "artillery-app"
    payload:
        path: "words.csv"
        fields:
            - "word"
        order: sequence
        skipHeader: true

    pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

    phases:
        - name: WarmUp
          duration: 30
          arrivalRate: 1

scenarios:
    - name: dictionary (/dictionary)
      flow:
          - get:
                url: "/dictionary?word={{ word }}"